20231226052415-method_overloading.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 10:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Method Overloading</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Method Overloading</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org31a8c18">1. Method Overloading</a>
<ul>
<li><a href="#orgab8d384">1.1. Example</a></li>
<li><a href="#org0fc6b1d">1.2. Reference Types</a>
<ul>
<li><a href="#org71d4fdf">1.2.1. Example</a></li>
</ul>
</li>
<li><a href="#org47b4d39">1.3. Primitive Types</a>
<ul>
<li><a href="#org1b76f41">1.3.1. Example</a></li>
</ul>
</li>
<li><a href="#org2ccd2a5">1.4. Autoboxing</a>
<ul>
<li><a href="#org81b0c27">1.4.1. Example</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org31a8c18" class="outline-2">
<h2 id="org31a8c18"><span class="section-number-2">1.</span> Method Overloading</h2>
<div class="outline-text-2" id="text-1">
<p>
Each method has a <b>signature</b>, which comprises the <code>name</code> of the method plus the <code>types</code> and order of the <code>parameters</code> in the formal <a href="20240111063906-parameter_list.html#ID-94f7186e-22e8-4636-bc8c-a4cc040d9073">parameter list</a>.
Several method implementations <b>may</b> have the same name, as long as the method signatures <b>differ</b>.
</p>

<p>
This practice is called <b>method overloading</b>.
</p>

<p>
Because <b>overloaded</b> methods have the same name, their parameter lists <b>must</b> be different.
</p>

<p>
At <code>compile time</code>, the <b>right implementation</b> of an <code>overloaded</code> method is chosen, based on the <code>signature</code> of the method call.
</p>
</div>

<div id="outline-container-orgab8d384" class="outline-3">
<h3 id="orgab8d384"><span class="section-number-3">1.1.</span> Example</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-java">void methodA(int a, double b) { /* ... */ } // (1)
int methodA(int a) { return a; } // (2)
int methodA() { return 1; } // (3)
long methodA(double a, int b) { return b; } // (4)
long methodA(int x, double y) { return x; } // (5) Not OK as 1 is a duplicate in parameterList.

int halfIt(int a) { return a/2; } // (6)
double halfIt(int a) { return a/2.0; } // (7) Not OK

// Example
public static double min(double a, double b)
public static float min(float a, float b)
public static int min(int a, int b)
public static long min(long a, long b)
</pre>
</div>

<p>
In the implementation, changing <b>just</b> the <code>return type</code> (as shown at (1) and (2) in the preceding example) is not enough to overload
a method and will be flagged as a <b>compile-time</b> error.
</p>

<div class="org-src-container">
<pre class="src src-java">int halfIt(int a) { return a/2; } // (1)
double halfIt(int a) { return a/2.0; } // (2) Not OK
</pre>
</div>
</div>
</div>

<div id="outline-container-org0fc6b1d" class="outline-3">
<h3 id="org0fc6b1d"><span class="section-number-3">1.2.</span> Reference Types</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org71d4fdf" class="outline-4">
<h4 id="org71d4fdf"><span class="section-number-4">1.2.1.</span> Example</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-java">public class Pelican {
    public void fly(String s) {
        System.out.print("string");
    }
    public void fly(Object o) {
        System.out.print("object");
    }
    public static void main(String[] args) {
        var p = new Pelican();
        p.fly("test"); // string
        System.out.print("-"); // -
        p.fly(56); // object
        // string-object
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org47b4d39" class="outline-3">
<h3 id="org47b4d39"><span class="section-number-3">1.3.</span> Primitive Types</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The answer is <code>int­long</code>.
</p>

<p>
The first call passes an <code>int</code> and sees an exact match.
The second call passes a <code>long</code> and also sees an exact match.
</p>
</div>

<div id="outline-container-org1b76f41" class="outline-4">
<h4 id="org1b76f41"><span class="section-number-4">1.3.1.</span> Example</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<pre class="src src-java">public class Ostrich {
    public void fly(int i) {
        System.out.print("int");
    }
    public void fly(long l) {
        System.out.print("long");
    }
    public static void main(String[] args) {
        var p = new Ostrich();
        p.fly(123); // int
        System.out.print("-"); // -
        p.fly(123L); // long
        // int-long
    }
}
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orged9d155"></a><span class="underline">Exam Trick</span><br />
<div class="outline-text-5" id="text-1-3-1-1">
<p>
If we comment out the overloaded method with the <code>int</code> parameter list, the output becomes <code>long­long</code>.
</p>

<p>
Java has no problem calling a <b>larger</b> primitive.
</p>

<p>
(However, it will not do so unless a better match is not found.)
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org2ccd2a5" class="outline-3">
<h3 id="org2ccd2a5"><span class="section-number-3">1.4.</span> Autoboxing</h3>
<div class="outline-text-3" id="text-1-4">
<p>
These method overloads are valid.
</p>
</div>

<div id="outline-container-org81b0c27" class="outline-4">
<h4 id="org81b0c27"><span class="section-number-4">1.4.1.</span> Example</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">
<pre class="src src-java">public class Kiwi {
    public void fly(int numMiles) {}
    public void fly(Integer numMiles) {}
}
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orgce52b37"></a><span class="underline">Exam Trick</span><br />
<div class="outline-text-5" id="text-1-4-1-1">
<p>
Java tries to use the most specific <a href="20240111063906-parameter_list.html#ID-94f7186e-22e8-4636-bc8c-a4cc040d9073">parameter list</a> it can find.
</p>

<p>
This is true for <a href="20231225083210-java_boxing.html#ID-2af44b3c-ac25-4fc8-a372-20adc491f7f5">autoboxing</a> as well as other matching types.
</p>

<p>
This means calling <code>fly(3)</code> will call the first method.
</p>

<p>
When the <b>primitive</b> <code>int</code> version isn’t present, Java will <a href="20231225083210-java_boxing.html#ID-2af44b3c-ac25-4fc8-a372-20adc491f7f5">autobox</a>.
</p>

<p>
However, when the <b>primitive</b> <code>int</code> version <b>is</b> provided, there is <b>no</b> reason for Java to do the extra work of autoboxing.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
